n5/src/InformationRegisters/Barcodes/Barcodes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Barcodes</name>
  <resources>
    <name>Feature</name>
    <type>
      <types>CatalogRef.Features</types>
    </type>
  </resources>
  <resources>
    <name>Item</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </resources>
  <resources>
    <name>Package</name>
    <type>
      <types>CatalogRef.Packages</types>
    </type>
  </resources>
  <resources>
    <name>Series</name>
    <type>
      <types>CatalogRef.Series</types>
    </type>
  </resources>
  <dimensions>
    <name>Barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/InformationRegisters/Barcodes/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtClient
Procedure NotificationProcessing ( EventName, Parameter, Source )
	
	if ( EventName = Enum.MessageBarcodeScanned ()
		and Source.FormOwner.UUID = ThisObject.UUID ) then
		install ( Parameter );
	endif; 
	
EndProcedure

&AtClient
Procedure install ( Fields )
	
	if ( Fields.Item = undefined ) then
		assign ( Fields.Barcode );
	else
		if ( Fields.Item = undefined ) then
			assign ( Fields.Barcode );
		else
			p = new Structure ( "Item",
				Print.FormatItem ( Fields.Item, Fields.Package, Fields.Feature, Fields.Series, Fields.Code ) );
			Output.ReplaceBarcode ( ThisObject, Fields.Barcode, p );
		endif; 
	endif; 
	
EndProcedure 

&AtClient
Procedure assign ( Barcode )
	
	Record.Barcode = Barcode;
	
EndProcedure 

&AtClient
Procedure ReplaceBarcode ( Answer, Barcode ) export
	
	if ( Answer = DialogReturnCode.No ) then
		return;
	endif; 
	detach ( Barcode );
	assign ( Barcode );
	
EndProcedure 

&AtServerNoContext
Procedure detach ( val Barcode )
	
	r = InformationRegisters.Barcodes.CreateRecordManager ();
	r.Barcode = Barcode;
	r.Delete ();
	
EndProcedure 

// *****************************************
// *********** Group Form

&AtClient
Procedure Scan ( Command )
	
	ScanForm.Scan ( ThisObject );
	
EndProcedure

&AtClient
Procedure NewEAN13 ( Command )
	
	Record.Barcode = Goods.NewEAN13 ();
	
EndProcedure
